In [1]:
import pandas as pd
import sqlite3

In [2]:
name = pd.read_csv("test_data/name.csv")
name.head()

   Unnamed: 0     nconst       primaryName
0          91  nm0000092       John Cleese
1          95  nm0000096  Gillian Anderson
2          97  nm0000098  Jennifer Aniston
3          99  nm0000100    Rowan Atkinson
4         100  nm0000101       Dan Aykroyd

In [3]:
basics = pd.read_csv("test_data/basics.csv")
basics.head()

,Unnamed: 0,tconst,primaryTitle,isAdult,startYear,runtimeMinutes,genres
0,106668,tt0109128,Washed Ashore,0,2023,86,Documentary
1,346016,tt0361130,Land of Nairi,0,2023,67,Documentary
2,409984,tt0427340,Masters of the Universe,0,2024,\N,"Action,Adventure,Animation"
3,421892,tt0439572,The Flash,0,2023,\N,"Action,Adventure,Fantasy"
4,433256,tt0451272,Nefarious,0,2023,85,"Crime,Thriller"

In [4]:
ratings = pd.read_csv("test_data/rating.csv")
ratings.head()

   Unnamed: 0      tconst  averageRating  numVotes
0       80737   tt0109128            7.2        29
1      204243   tt0361130            5.4         8
2      450728  tt10087728            6.2        66
3      451243  tt10098448            7.8      4357
4      454007  tt10151854            6.6     17303

In [5]:
principals = pd.read_csv("test_data/principals.csv")
principals.head()

   Unnamed: 0     tconst     nconst  category
0      935619  tt0109128  nm0315430  director
1     2608304  tt0361130  nm0067384  director
2     3048054  tt0427340  nm6563873     actor
3     3048055  tt0427340  nm1887480  director
4     3048056  tt0427340  nm1519639  director

In [6]:
# Create the database
con = sqlite3.connect("test_imdb.db")

In [7]:
name.to_sql("name", con, index = False, if_exists = 'replace')

24910

In [8]:
basics.to_sql("basics", con, index=False,if_exists = 'replace')

6853

In [9]:
ratings.to_sql("ratings", con, index = False,if_exists = 'replace')

1381

In [10]:
principals.to_sql("principals", con, index = False,if_exists = 'replace')

28594

In [11]:
cursor = con.cursor()

In [12]:
# Define the name of the table to delete
table_name = ['countries','stations']

# Execute the DROP TABLE statement
cursor.execute("DROP TABLE IF EXISTS {}".format(table_name))

In [13]:
con.commit()

In [14]:
import sqlite3

# Connect to the database
conn = sqlite3.connect('test_imdb.db')

# Create a cursor object
cursor = conn.cursor()

# Define the SQL query to join the tables
query = """
    SELECT *
    FROM principals
    JOIN ratings ON principals.tconst = ratings.tconst
    JOIN basics ON principals.tconst = basics.tconst
    JOIN name ON principals.nconst = name.nconst;
"""

# Execute the query and fetch the results
cursor.execute(query)

imdb = pd.read_sql_query(query,conn)
imdb.head()

,Unnamed: 0,tconst,nconst,category,Unnamed: 0,tconst,averageRating,numVotes,Unnamed: 0,tconst,primaryTitle,isAdult,startYear,runtimeMinutes,genres,Unnamed: 0,nconst,primaryName
0,935619,tt0109128,nm0315430,director,80737,tt0109128,7.2,29,106668,tt0109128,Washed Ashore,0,2023,86,Documentary,298791,nm0315430,Nikolaus Geyrhalter
1,2608304,tt0361130,nm0067384,director,204243,tt0361130,5.4,8,346016,tt0361130,Land of Nairi,0,2023,67,Documentary,64328,nm0067384,Amo Bek-Nazaryan
2,7698688,tt10087728,nm4015380,actor,450728,tt10087728,6.2,66,1016512,tt10087728,Phalana Abbayi Phalana Ammayi,0,2023,126,"Drama,Family,Romance",7561454,nm4015380,Srinivas Avasarala
3,7698689,tt10087728,nm6325281,actress,450728,tt10087728,6.2,66,1016512,tt10087728,Phalana Abbayi Phalana Ammayi,0,2023,126,"Drama,Family,Romance",9493752,nm6325281,Malvika Nair
4,7698690,tt10087728,nm6601752,actor,450728,tt10087728,6.2,66,1016512,tt10087728,Phalana Abbayi Phalana Ammayi,0,2023,126,"Drama,Family,Romance",9705734,nm6601752,Naga Shaurya

In [15]:
imdb = imdb.loc[:, ~imdb.columns.duplicated()]
imdb.head()

,Unnamed: 0,tconst,nconst,category,averageRating,numVotes,primaryTitle,isAdult,startYear,runtimeMinutes,genres,primaryName
0,935619,tt0109128,nm0315430,director,7.2,29,Washed Ashore,0,2023,86,Documentary,Nikolaus Geyrhalter
1,2608304,tt0361130,nm0067384,director,5.4,8,Land of Nairi,0,2023,67,Documentary,Amo Bek-Nazaryan
2,7698688,tt10087728,nm4015380,actor,6.2,66,Phalana Abbayi Phalana Ammayi,0,2023,126,"Drama,Family,Romance",Srinivas Avasarala
3,7698689,tt10087728,nm6325281,actress,6.2,66,Phalana Abbayi Phalana Ammayi,0,2023,126,"Drama,Family,Romance",Malvika Nair
4,7698690,tt10087728,nm6601752,actor,6.2,66,Phalana Abbayi Phalana Ammayi,0,2023,126,"Drama,Family,Romance",Naga Shaurya

In [16]:
imdb1=imdb.copy()

In [17]:
imdb.to_csv('test_imdb.csv', index=False)

In [18]:
imdb.shape

(6467, 12)

In [19]:
imdb.to_sql("imdb", conn, index = False,if_exists = 'replace')

6467

In [20]:
conn.close()